StoicaRazvanCornelius/STM32F411RE_UART/Src/main.c
#include "stm32f4xx_hal.h"

UART_HandleTypeDef huart2;
void uart_init(void);

int main()
{
	HAL_Init();
	uart_init();
	while(1)
	{
		//HAL_UART_Transmit ()
	}
}

void SysTick_Handler(void)
{
	HAL_IncTick();
}

void uart_init(void)
{

	GPIO_InitTypeDef GPIO_InitStruct = {0};

	//enable UART pins clock access
	__HAL_RCC_GPIOA_CLK_ENABLE();

	//enable UART module clock access
	__HAL_RCC_USART2_CLK_ENABLE();

	//Configure pins to act as alternate functions pins(UART)
	GPIO_InitStruct.Pin       = GPIO_PIN_2|GPIO_PIN_3;
	GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
	GPIO_InitStruct.Pull 	  = GPIO_NOPULL;
	GPIO_InitStruct.Speed 	  = GPIO_SPEED_FREQ_VERY_HIGH;

	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	//Configure UART module
	huart2.Instance = USART2;
	huart2.Init.BaudRate = 115200;
	huart2.Init.WordLength = UART_WORDLENGTH_8B;
	huart2.Init.StopBits = UART_STOPBITS_1;
	huart2.Init.Mode = UART_MODE_TX;
	huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart2.Init.OverSampling = UART_OVERSAMPLING_16;

	HAL_UART_Init(&huart2 );


}
